In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'경부선':[39060, 39896, 42005, 43621, 41702, 41266, 32427],
       '호남선':[7317, 6967, 6873, 6626, 8675, 10622, 9228],
       '경전선':[3627, 4168, 4088, 4424, 4606, 4984, 5570],
       '전라선':[309, 1771, 1954, 2244, 3146, 3945, 5766],
       '동해선':[np.nan, np.nan, np.nan, np.nan, 2395, 3786, 6667]}
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df1 = pd.DataFrame(data, index = index_list)
df1

        경부선    호남선   경전선   전라선     동해선
2011  39060   7317  3627   309     NaN
2012  39896   6967  4168  1771     NaN
2013  42005   6873  4088  1954     NaN
2014  43621   6626  4424  2244     NaN
2015  41702   8675  4606  3146  2395.0
2016  41266  10622  4984  3945  3786.0
2017  32427   9228  5570  5766  6667.0

In [3]:
print(df1.head(3))  # 데이터를 처음부터 지정한 개수까지 출력 , default = 5
print(df1.tail(2))  # 데이터를 끝부터 지정한 개수까지 출력 , default = 5

        경부선   호남선   경전선   전라선  동해선
2011  39060  7317  3627   309  NaN
2012  39896  6967  4168  1771  NaN
2013  42005  6873  4088  1954  NaN
        경부선    호남선   경전선   전라선     동해선
2016  41266  10622  4984  3945  3786.0
2017  32427   9228  5570  5766  6667.0

In [6]:
df1[2:5]  # 연속된 구간의 행 데이터 출력

        경부선   호남선   경전선   전라선     동해선
2013  42005  6873  4088  1954     NaN
2014  43621  6626  4424  2244     NaN
2015  41702  8675  4606  3146  2395.0

In [7]:
df1[3:4]  # 원하는 행의 데이터 출력

        경부선   호남선   경전선   전라선  동해선
2014  43621  6626  4424  2244  NaN

In [13]:
df1.loc['2014']  # 원하는 행을 인덱스 항목이름으로 데이터 출력

경부선    43621.0
호남선     6626.0
경전선     4424.0
전라선     2244.0
동해선        NaN
Name: 2014, dtype: float64

In [16]:
df1['경전선']  # 원하는 열을 columns 항목이름으로 데이터 출력

2011    3627
2012    4168
2013    4088
2014    4424
2015    4606
2016    4984
2017    5570
Name: 경전선, dtype: int64

In [19]:
df1[['경전선', '동해선']]  # 원하는 열들을 columns 항목이름으로 데이터 출력

       경전선     동해선
2011  3627     NaN
2012  4168     NaN
2013  4088     NaN
2014  4424     NaN
2015  4606  2395.0
2016  4984  3786.0
2017  5570  6667.0

In [20]:
df1['경부선']['2012':'2014']  # 하나의 열을 선택 수 index의 범위를 지정해 원하는 데이터만 출력

2012    39896
2013    42005
2014    43621
Name: 경부선, dtype: int64

In [22]:
df1['경부선'][1:4]  # 하나의 열을 선택 수 index의 위치를 지정해 원하는 데이터만 출력

2012    39896
2013    42005
2014    43621
Name: 경부선, dtype: int64

In [25]:
print(df1.loc['2016']['호남선'])  # 하나의 원소만 출력하는 여러가지 방법
print(df1.loc['2016', '호남선'])
print(df1['호남선']['2016'])
print(df1['호남선'][5])
print(df1['호남선'].loc['2016'])

10622.0
10622
10622
10622
10622

In [26]:
df2 = pd.DataFrame({'Class1':[95, 92, 54, 78], 'Class2':[88, 78, 97, 70]})
df2

   Class1  Class2
0      95      88
1      92      78
2      54      97
3      78      70

In [27]:
df3 = pd.DataFrame({'Class1':[87, 99], 'Class2':[85, 90]})
df3

   Class1  Class2
0      87      85
1      99      90

In [28]:
df2.append(df3)  # columns가 같은 두 데이터를 세로 방향으로 합친다.

   Class1  Class2
0      95      88
1      92      78
2      54      97
3      78      70
0      87      85
1      99      90

In [30]:
df2.append(df3, ignore_index = True)  # 기존 인덱스를 무시하고 새로 순차적으로 인덱스를 부여한다.

   Class1  Class2
0      95      88
1      92      78
2      54      97
3      78      70
4      87      85
5      99      90

In [31]:
df4 = pd.DataFrame({'Class1':[96, 83]})
df4

   Class1
0      96
1      83

In [35]:
df3.append(df4, ignore_index = True)  # columns가 같지 않은 데이터를 합치면 데이터가 없는 부분은 NaN으로 표시된다.

   Class1  Class2
0      87    85.0
1      99    90.0
2      96     NaN
3      83     NaN

In [36]:
df5 = pd.DataFrame({'Class3':[95, 90, 99, 81]})
df5

   Class3
0      95
1      90
2      99
3      81

In [38]:
df2.join(df5)  # 인덱스가 같은 두 데이터를 가로방향으로 합치기

   Class1  Class2  Class3
0      95      88      95
1      92      78      90
2      54      97      99
3      78      70      81

In [39]:
df6 = pd.DataFrame({'Class4':[88, 90]})
df6

   Class4
0      88
1      90

In [40]:
df2.join(df6)  # index 크기가 다른 데이터를 합치면 데이터가 없는 부분은 NaN으로 채워진다.

   Class1  Class2  Class4
0      95      88    88.0
1      92      78    90.0
2      54      97     NaN
3      78      70     NaN

In [41]:
df7 = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                   '제품A':[100, 150, 200, 130],
                   '제품B':[90, 110, 140, 170]})
df7

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [42]:
df8 = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                   '제품C':[112, 141, 203, 134],
                   '제품D':[90, 110, 140, 170]})
df8

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [43]:
df7.merge(df8)  # 특정 열을 기준으로 왼쪽과 오른쪽 데이터 중 공통 항목만 선택

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [44]:
df9 = pd.DataFrame({'key':['A', 'B', 'C'], 'left':[1, 2, 3]})
df9

  key  left
0   A     1
1   B     2
2   C     3

In [47]:
df10 = pd.DataFrame({'key':['A', 'B', 'D'], 'right':[4, 5, 6]})
df10

  key  right
0   A      4
1   B      5
2   D      6

In [48]:
df9.merge(df10, how = 'left', on = 'key')  # 왼쪽 데이터는 모두 선택하고 지정한 key값이 있는 오른쪽 데이터 출력

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [49]:
df9.merge(df10, how = 'right', on = 'key')  # 오른쪽 데이터는 모두 선택하고 지정한 key값이 있는 왼쪽 데이터 출력

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [51]:
df9.merge(df10, how = 'outer', on = 'key')  # 지정한 key를 기준으로 왼쪽과 오른쪽 데이터를 모두 출력

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0